import random
    # Крестики-нолики
print("=====КРЕСТИКИ-НОЛИКИ=====")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ 1 │ │ 2 │ │ 3 │")
print("    └───┘ └───┘ └───┘")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ 4 │ │ 5 │ │ 6 │")
print("    └───┘ └───┘ └───┘")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ 7 │ │ 8 │ │ 9 │")
print("    └───┘ └───┘ └───┘")
print("=========================")

клетка_1 = "1"
клетка_2 = "2"
клетка_3 = "3"
клетка_4 = "4"
клетка_5 = "5"
клетка_6 = "6"
клетка_7 = "7"
клетка_8 = "8"
клетка_9 = "9"

клетка = int(input("Выберите номер для клетки: "))
if клетка == 1:
    клетка_1 = "✘"
elif клетка == 2:
    клетка_2 = "✘"
elif клетка == 3:
    клетка_3 = "✘"
elif клетка == 4:
    клетка_4 = "✘"
elif клетка == 5:
    клетка_5 = "✘"
elif клетка == 6:
    клетка_6 = "✘"
elif клетка == 7:
    клетка_7 = "✘"
elif клетка == 8:
    клетка_8 = "✘"
elif клетка == 9:
    клетка_9 = "✘"

свободные_клетки = [1, 2, 3, 4, 5, 6, 7, 8, 9]
свободные_клетки.remove(клетка)
нолик = random.choice(свободные_клетки)
print("Компьютер выбрал:", нолик)

if нолик == 1:
    клетка_1 = "◯"
elif нолик == 2:
    клетка_2 = "◯"
elif нолик == 3:
    клетка_3 = "◯"
elif нолик == 4:
    клетка_4 = "◯"
elif нолик == 5:
    клетка_5 = "◯"
elif нолик == 6:
    клетка_6 = "◯"
elif нолик == 7:
    клетка_7 = "◯"
elif нолик == 8:
    клетка_8 = "◯"
elif нолик == 9:
    клетка_9 = "◯"

print("=====КРЕСТИКИ-НОЛИКИ=====")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ " + клетка_1 + " │ │ " + клетка_2 + " │ │ " + клетка_3 + " │")
print("    └───┘ └───┘ └───┘")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ " + клетка_4 + " │ │ " + клетка_5 + " │ │ " + клетка_6 + " │")
print("    └───┘ └───┘ └───┘")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ " + клетка_7 + " │ │ " + клетка_8 + " │ │ " + клетка_9 + " │")
print("    └───┘ └───┘ └───┘")
print("=========================")

клетка = int(input("Выберите номер для клетки: "))
if клетка == 1:
    клетка_1 = "✘"
elif клетка == 2:
    клетка_2 = "✘"
elif клетка == 3:
    клетка_3 = "✘"
elif клетка == 4:
    клетка_4 = "✘"
elif клетка == 5:
    клетка_5 = "✘"
elif клетка == 6:
    клетка_6 = "✘"
elif клетка == 7:
    клетка_7 = "✘"
elif клетка == 8:
    клетка_8 = "✘"
elif клетка == 9:
    клетка_9 = "✘"

свободные_клетки = [1, 2, 3, 4, 5, 6, 7, 8, 9]
свободные_клетки.remove(клетка)
нолик = random.choice(свободные_клетки)
print("Компьютер выбрал:", нолик)

if нолик == 1:
    клетка_1 = "◯"
elif нолик == 2:
    клетка_2 = "◯"
elif нолик == 3:
    клетка_3 = "◯"
elif нолик == 4:
    клетка_4 = "◯"
elif нолик == 5:
    клетка_5 = "◯"
elif нолик == 6:
    клетка_6 = "◯"
elif нолик == 7:
    клетка_7 = "◯"
elif нолик == 8:
    клетка_8 = "◯"
elif нолик == 9:
    клетка_9 = "◯"

print("=====КРЕСТИКИ-НОЛИКИ=====")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ " + клетка_1 + " │ │ " + клетка_2 + " │ │ " + клетка_3 + " │")
print("    └───┘ └───┘ └───┘")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ " + клетка_4 + " │ │ " + клетка_5 + " │ │ " + клетка_6 + " │")
print("    └───┘ └───┘ └───┘")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ " + клетка_7 + " │ │ " + клетка_8 + " │ │ " + клетка_9 + " │")
print("    └───┘ └───┘ └───┘")
print("=========================")

def проверить_победу(поле):
    if поле[0] != " " and поле[0] == поле[1] == поле[2]:
        print("Победа!")
        return True
    if поле[3] != " " and поле[3] == поле[4] == поле[5]:
        print("Победа!")
        return True
    if поле[6] != " " and поле[6] == поле[7] == поле[8]:
        print("Победа!")
        return True
    if поле[0] != " " and поле[0] == поле[3] == поле[6]:
        print("Победа!")
        return True
    if поле[1] != " " and поле[1] == поле[4] == поле[7]:
        print("Победа!")
        return True
    if поле[2] != " " and поле[2] == поле[5] == поле[8]:
        print("Победа!")
        return True
    if поле[0] != " " and поле[0] == поле[4] == поле[8]:
        print("Победа!")
        return True
    if поле[2] != " " and поле[2] == поле[4] == поле[6]:
        print("Победа!")
        return True

print("=====КРЕСТИКИ-НОЛИКИ=====")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ " + клетка_1 + " │ │ " + клетка_2 + " │ │ " + клетка_3 + " │")
print("    └───┘ └───┘ └───┘")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ " + клетка_4 + " │ │ " + клетка_5 + " │ │ " + клетка_6 + " │")
print("    └───┘ └───┘ └───┘")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ " + клетка_7 + " │ │ " + клетка_8 + " │ │ " + клетка_9 + " │")
print("    └───┘ └───┘ └───┘")
print("=========================")

клетка = int(input("Выберите номер для клетки: "))
if клетка == 1:
    клетка_1 = "✘"
elif клетка == 2:
    клетка_2 = "✘"
elif клетка == 3:
    клетка_3 = "✘"
elif клетка == 4:
    клетка_4 = "✘"
elif клетка == 5:
    клетка_5 = "✘"
elif клетка == 6:
    клетка_6 = "✘"
elif клетка == 7:
    клетка_7 = "✘"
elif клетка == 8:
    клетка_8 = "✘"
elif клетка == 9:
    клетка_9 = "✘"

свободные_клетки = [1, 2, 3, 4, 5, 6, 7, 8, 9]
свободные_клетки.remove(клетка)
нолик = random.choice(свободные_клетки)
print("Компьютер выбрал:", нолик)

if нолик == 1:
    клетка_1 = "◯"
elif нолик == 2:
    клетка_2 = "◯"
elif нолик == 3:
    клетка_3 = "◯"
elif нолик == 4:
    клетка_4 = "◯"
elif нолик == 5:
    клетка_5 = "◯"
elif нолик == 6:
    клетка_6 = "◯"
elif нолик == 7:
    клетка_7 = "◯"
elif нолик == 8:
    клетка_8 = "◯"
elif нолик == 9:
    клетка_9 = "◯"

def проверить_победу(поле):
    if поле[0] != " " and поле[0] == поле[1] == поле[2]:
        print("Победа!")
        return True
    if поле[3] != " " and поле[3] == поле[4] == поле[5]:
        print("Победа!")
        return True
    if поле[6] != " " and поле[6] == поле[7] == поле[8]:
        print("Победа!")
        return True
    if поле[0] != " " and поле[0] == поле[3] == поле[6]:
        print("Победа!")
        return True
    if поле[1] != " " and поле[1] == поле[4] == поле[7]:
        print("Победа!")
        return True
    if поле[2] != " " and поле[2] == поле[5] == поле[8]:
        print("Победа!")
        return True
    if поле[0] != " " and поле[0] == поле[4] == поле[8]:
        print("Победа!")
        return True
    if поле[2] != " " and поле[2] == поле[4] == поле[6]:
        print("Победа!")
        return True


print("=====КРЕСТИКИ-НОЛИКИ=====")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ " + клетка_1 + " │ │ " + клетка_2 + " │ │ " + клетка_3 + " │")
print("    └───┘ └───┘ └───┘")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ " + клетка_4 + " │ │ " + клетка_5 + " │ │ " + клетка_6 + " │")
print("    └───┘ └───┘ └───┘")
print("    ┌───┐ ┌───┐ ┌───┐")
print("    │ " + клетка_7 + " │ │ " + клетка_8 + " │ │ " + клетка_9 + " │")
print("    └───┘ └───┘ └───┘")
print("=========================")


