# ПЗ 21-23
import random
import sys

# константы
a = random.randint(0, 65)
spec = random.randint(0, 1)
wknds = random.randint(0, 1)
ст = random.randint(86, 89)
дп = random.randint(94, 102)
дв = random.randint(89, 95)

# работа с баком
x = a
if x <= 50:
    print("Добро пожаловать на наш бурмАлЗС!")
    print("Наши актуальные цены за литр:")
    print("100 - ", ст,"р.")
    print("95 - ", дп,"р.")
    print("92 - ", дв,"р.")
    print("       !!СКИДКИ:")
    print("Если Сегодня выходной, и вы покупаете больше 40л., вы получаете скидку 10%")
    print("Также по нашей спец-карте можно полуить постоянную скидку в размере 5%!")
    print("А ваш действительный бак:", x)
else:
    print("Объем вашего бака", x, "л. превышает лимит, ползите на все 4 стороны.")
    sys.exit

# заправка
n = 1
print("'Стоп'- закончить заправку. 'Начать'- начать заправку.")
k = input(f"")
while True:
    if k.lower() == "стоп":
        print("Спасибо, что воспользовались нашими услугами!")
        break
    elif k.lower() == "дальше" or "начать":
        print("'Стоп'- закончить заправку. 'Дальше'- купить еще.")
        ном = int(input(f"Введите нумерацию бензина, который нужен для заправки (92, 95 или 100): "))
        if ном == 92:
            n += int(input(f"Введите количество литров для заправки: "))
            if n > 40 and wknds == 1:
                if spec == 1:
                    print("Ваша скидка за заправку 15%.")
                    print("Стоимость без скидки:", n * дв, ".")
                    print("Итоговая стоимость:", n * дв % 15, ".")
                    g = input(f"Да - оплатить. Нет - Отказатся от оплаты.")
                    if g.lower() == "да":
                        print("Вы оплатили. Спасибо за покупку!")
                    elif g.lower() == "нет":
                        sys.exit
                elif spec == 0:
                    print("Ваша скидка за заправку 10%.")
                    print("Стоимость без скидки:", n * дв, ".")
                    print("Итоговая стоимость:", n * дв % 10, ".")
                    g = input(f"Да - оплатить. Нет - Отказатся от оплаты.")
                    if g.lower() == "да":
                        print("Вы оплатили. Спасибо за покупку!")
                    elif g.lower() == "нет":
                        sys.exit
            elif n <= 40:
                            if spec == 1:
                                print("Ваша скидка за заправку 5%.")
                                print("Стоимость без скидки:", n * дв, ".")
                                print("Итоговая стоимость:", n * дв % 5, ".")
                                g = input(f"Да - оплатить. Нет - Отказатся от оплаты.")
                                if g.lower() == "да":
                                    print("Вы оплатили. Спасибо за покупку!")
                                elif g.lower() == "нет":
                                    sys.exit
                            elif spec == 0:
                                print("У вас отсутствуют скидки.")
                                print("Итоговая стоимость:", n * дв, ".")
                                g = input(f"Да - оплатить. Нет - Отказатся от оплаты.")
                                if g.lower() == "да":
                                    print("Вы оплатили. Спасибо за покупку!")
                                elif g.lower() == "нет":
                                    sys.exit
        elif ном == 95:
            n += int(input(f"Введите количество литров для заправки: "))
            if n > 40 and wknds == 1:
                if spec == 1:
                    print("Ваша скидка за заправку 15%.")
                    print("Стоимость без скидки:", n * дп, ".")
                    print("Итоговая стоимость:", n * дп % 15, ".")
                    g = input(f"Да - оплатить. Нет - Отказатся от оплаты.")
                    if g.lower() == "да":
                        print("Вы оплатили. Спасибо за покупку!")
                    elif g.lower() == "нет":
                        sys.exit
                elif spec == 0:
                    print("Ваша скидка за заправку 10%.")
                    print("Стоимость без скидки:", n * дп, ".")
                    print("Итоговая стоимость:", n * дп % 10, ".")
                    g = input(f"Да - оплатить. Нет - Отказатся от оплаты.")
                    if g.lower() == "да":
                        print("Вы оплатили. Спасибо за покупку!")
                    elif g.lower() == "нет":
                        sys.exit
            elif n <= 40:
                            if spec == 1:
                                print("Ваша скидка за заправку 5%.")
                                print("Стоимость без скидки:", n * дп, ".")
                                print("Итоговая стоимость:", n * дп % 5, ".")
                                g = input(f"Да - оплатить. Нет - Отказатся от оплаты.")
                                if g.lower() == "да":
                                    print("Вы оплатили. Спасибо за покупку!")
                                elif g.lower() == "нет":
                                    sys.exit
                            elif spec == 0:
                                print("У вас отсутствуют скидки.")
                                print("Итоговая стоимость:", n * дп, ".")
                                g = input(f"Да - оплатить. Нет - Отказатся от оплаты.")
                                if g.lower() == "да":
                                    print("Вы оплатили. Спасибо за покупку!")
                                elif g.lower() == "нет":
                                    sys.exit
            elif ном == 100:
                        n += int(input(f"Введите количество литров для заправки: "))
                        if n > 40 and wknds == 1:
                            if spec == 1:
                                print("Ваша скидка за заправку 15%.")
                                print("Стоимость без скидки:", n * дп, ".")
                                print("Итоговая стоимость:", n * дп % 15, ".")
                                g = input(f"Да - оплатить. Нет - Отказатся от оплаты.")
                                if g.lower() == "да":
                                    print("Вы оплатили. Спасибо за покупку!")
                                elif g.lower() == "нет":
                                    sys.exit
                            elif spec == 0:
                                print("Ваша скидка за заправку 10%.")
                                print("Стоимость без скидки:", n * дп, ".")
                                print("Итоговая стоимость:", n * дп % 10, ".")
                                g = input(f"Да - оплатить. Нет - Отказатся от оплаты.")
                                if g.lower() == "да":
                                    print("Вы оплатили. Спасибо за покупку!")
                                elif g.lower() == "нет":
                                    sys.exit
                        elif n <= 40:
                                        if spec == 1:
                                            print("Ваша скидка за заправку 5%.")
                                            print("Стоимость без скидки:", n * дп, ".")
                                            print("Итоговая стоимость:", n * дп % 5, ".")
                                            g = input(f"Да - оплатить. Нет - Отказатся от оплаты.")
                                            if g.lower() == "да":
                                                print("Вы оплатили. Спасибо за покупку!")
                                            elif g.lower() == "нет":
                                                sys.exit
                                        elif spec == 0:
                                            print("У вас отсутствуют скидки.")
                                            print("Итоговая стоимость:", n * дп, ".")
                                            g = input(f"Да - оплатить. Нет - Отказатся от оплаты.")
                                            if g.lower() == "да":
                                                print("Вы оплатили. Спасибо за покупку!")
                                            elif g.lower() == "нет":
                                                sys.exit
